aws/amazon-freertos/lib/ota/portable/nordic/nrf52840-dk/aws_ota_pal.c
/*
 * Amazon FreeRTOS OTA PAL V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/* C Runtime includes. */
#include <stdio.h>
#include <stdlib.h>

/* Amazon FreeRTOS include. */
#include "FreeRTOS.h"
#include "aws_ota_agent.h"
#include "aws_ota_pal.h"
#include "aws_ota_agent_internal.h"
#include "aws_ota_pal_settings.h"
#include "aws_ota_codesigner_certificate.h"

#include "mbedtls/base64.h"
#include "nrf_mbr.h"
#include "nrf_sdm.h"
#include "nrf_nvmc.h"
#include "nrf_sdh_soc.h"
#include "nrf_crypto.h"

#include "event_groups.h"

/* Specify the OTA signature algorithm we support on this platform. */
const char pcOTA_JSON_FileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";
const char pcOTA_PAL_Magick[ otapalMAGICK_SIZE ] = "@AFRTOS";
const size_t otapalFLASH_END = ( size_t ) &__FLASH_segment_end__;
/* Tag by which the beginning of the ECDSA in the public key can be found */
const char pcOTA_PAL_ASN_1_ECDSA_TAG[] = "\x06\x07\x2A\x86\x48\xCE\x3D\x02\x01\x06\x08\x2A\x86\x48\xCE\x3D\x03\x01\x07";

uint8_t * pucPublicKey;
static uint32_t pulSerializingArray[otapalSERIALIZING_ARRAY_SIZE];
size_t ulPublicKeySize = 0;

/* The static functions below (prvPAL_CheckFileSignature and prvPAL_ReadAndAssumeCertificate)
 * are optionally implemented. If these functions are implemented then please set the following macros in
 * aws_test_ota_config.h to 1:
 * otatestpalCHECK_FILE_SIGNATURE_SUPPORTED
 * otatestpalREAD_AND_ASSUME_CERTIFICATE_SUPPORTED
 */

/**
 * @brief Verify the signature of the specified file.
 *
 * This function should be implemented if signature verification is not offloaded
 * to non-volatile memory io functions.
 *
 * This function is called from prvPAL_Close().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * kOTA_Err_None if the signature verification passes.
 * kOTA_Err_SignatureCheckFailed if the signature verification fails.
 * kOTA_Err_BadSignerCert if the if the signature verification certificate cannot be read.
 *
 */
static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C );

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize );

/**
 * @brief Populates a flash memory location with an image descriptor.
 *
 * @param[in] C OTA file context information.
 *
 * @return A number of bytes written or -1 if an error happened.
 */
static ret_code_t prvPAL_WriteImageDescriptor( OTA_FileContext_t * const C );

/**
 * @brief Sincronously write data to flash
 *
 * @param[in] ulOffset Position to write
 * @param[in] ulBlockSize Data size
 * @param[in] pacData Data to be written
 *
 * @return Amount of written data or -1 in the case of error
 */
static ret_code_t prvWriteFlash( uint32_t ulOffset,
                                 uint32_t ulBlockSize,
                                 uint8_t * const pacData );

static int prvNextFreeFileHandle = 1;
static EventGroupHandle_t xFlashEventGrp = NULL;

/*-----------------------------------------------------------*/

ret_code_t prvComputeSHA256Hash( void * pvMessage,
                                 size_t ulMessageSize,
                                 void * pvHashDigest,
                                 size_t * pulDigestSize );

/*-----------------------------------------------------------*/

ret_code_t prvVerifySignature( uint8_t * pusHash,
                               size_t ulHashSize,
                               uint8_t * pusSignature,
                               size_t ulSignatureSize,
                               uint8_t * pucPublicKey,
                               uint32_t ulPublicKeySize);

/*-----------------------------------------------------------*/

OTA_Err_t prvErasePages(size_t xFrom, size_t xTo)
{
    size_t ulErasedAddress = (size_t) xFrom;
    OTA_Err_t xStatus = kOTA_Err_None;
    ret_code_t xErrCode = NRF_SUCCESS;
    while(xStatus == kOTA_Err_None && ulErasedAddress < (size_t) xTo )
    {
        size_t ulErasedPage = ( size_t ) ( ulErasedAddress / NRF_FICR->CODEPAGESIZE );
        ulErasedAddress += NRF_FICR->CODEPAGESIZE;
        xEventGroupClearBits( xFlashEventGrp, otapalFLASH_SUCCESS | otapalFLASH_FAILURE );
        xErrCode = sd_flash_page_erase( ulErasedPage );

        if( xErrCode != NRF_SUCCESS )
        {
            xStatus = kOTA_Err_RxFileCreateFailed;
        }
        else
        {
            EventBits_t xFlashResult = xEventGroupWaitBits( xFlashEventGrp, otapalFLASH_SUCCESS | otapalFLASH_FAILURE, pdTRUE, pdFALSE, portMAX_DELAY );
            if( xFlashResult & otapalFLASH_FAILURE )
            {
                xStatus = kOTA_Err_RxFileCreateFailed;
            }
        }
    }
    return xStatus;
}

