aws/amazon-freertos/lib/ota/portable/nordic/nrf52840-dk/aws_ota_pal.c
OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );
    ret_code_t xErrCode;
    C->iFileHandle = prvNextFreeFileHandle;
    OTA_Err_t xStatus = kOTA_Err_None;
    /* Check that the second bank size is big enough to contain the new firmware */
    if( C->ulFileSize > otapalSECOND_BANK_SIZE )
    {
        xStatus = kOTA_Err_OutOfMemory;
    }
    if (xStatus == kOTA_Err_None){
        /* Create the event group for flash events */
        xFlashEventGrp = xEventGroupCreate();

        if( xFlashEventGrp == NULL )
        {
            OTA_LOG_L1( "[%s] No memory for creation of event group \n", OTA_METHOD_NAME );
            xStatus = kOTA_Err_OutOfMemory;
        }
    }
    if (xStatus == kOTA_Err_None){
        /* Erase the required memory */
        OTA_LOG_L1( "[%s] Erasing the flash memory \n", OTA_METHOD_NAME );
        xStatus = prvErasePages(otapalSECOND_BANK_START, otapalSECOND_BANK_SIZE);
        if (xStatus != kOTA_Err_None) 
        {
             OTA_LOG_L1( "[%s] Erasing the flash memory failed with error_code %d\n", OTA_METHOD_NAME, xStatus );
        }
    }

    return xStatus;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );

    C->iFileHandle = ( int32_t ) NULL;
    /* Delete the event group */
    if( xFlashEventGrp != NULL )
    {
        vEventGroupDelete( xFlashEventGrp );
        xFlashEventGrp = NULL;
    }

    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );

    /* We assume that the flash is already erased by this address (it should be, as we erase it in the
     * prvPAL_CreateFileForRx, but the second write to the same position can break this invariant.
     * Anyway, the OTA procedure must not try to write to the same addresses */
    ret_code_t xErrCode = prvWriteFlash( otapalSECOND_BANK_START + otapalDESCRIPTOR_SIZE + ulOffset, ulBlockSize, pacData );

    if( xErrCode == NRF_SUCCESS )
    {
        OTA_LOG_L1( "[%s] Write %ul bytes from the %ul address \n", OTA_METHOD_NAME, ulBlockSize, ulOffset );
        return ulBlockSize;
    }
    else
    {
        OTA_LOG_L1( "[%s] Write %ul bytes from the %ul address failed with error code %d\n", OTA_METHOD_NAME, ulBlockSize,
                    ulOffset, xErrCode );
        return -1;
    }
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    OTA_Err_t xError;
    ret_code_t xStatus;

    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );

    OTA_LOG_L1( "[%s] Erasing the flash memory was successful\n", OTA_METHOD_NAME );

    /* Write the image descriptor */
    xStatus = prvPAL_WriteImageDescriptor( C );
    if(xStatus == NRF_SUCCESS)
    {
      /* Increment the file handler */
        prvNextFreeFileHandle += 1;

        xError = prvPAL_CheckFileSignature( C );
    }else
    {
        xError = kOTA_Err_SignatureCheckFailed;
    }

    return xError;
}
/*-----------------------------------------------------------*/


static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature" );

    nrf_crypto_hash_sha256_digest_t xHash;
    size_t ulHashLength = sizeof( xHash );
    ret_code_t xErrCode = NRF_SUCCESS;
    ImageDescriptor_t * descriptor = ( ImageDescriptor_t * ) ( otapalSECOND_BANK_START );
    uint32_t ulCertificateSize = 0;
    uint8_t *pusCertificate = prvPAL_ReadAndAssumeCertificate (NULL, &ulCertificateSize);
    if (pusCertificate == NULL) {
        xErrCode = NRF_ERROR_INTERNAL;
    }
    if (xErrCode == NRF_SUCCESS) {
        prvComputeSHA256Hash( (uint8_t *)otapalSECOND_BANK_START + otapalDESCRIPTOR_SIZE, C->ulFileSize, &xHash, &ulHashLength );
        xErrCode = prvVerifySignature( (uint8_t*) &xHash, ulHashLength, descriptor->pSignature, descriptor->ulSignatureSize, pusCertificate, ulCertificateSize );
        vPortFree( pusCertificate );        
    }

    if( xErrCode != NRF_SUCCESS )
    {
        OTA_LOG_L1( "[%s] Signature check failed \n", OTA_METHOD_NAME );
        return kOTA_Err_SignatureCheckFailed;
    }

    OTA_LOG_L1( "[%s] Signature check passed \n", OTA_METHOD_NAME );
    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    uint8_t * pusCertificate;

    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );
    * ulSignerCertSize = sizeof(signingcredentialSIGNING_CERTIFICATE_PEM);
    /* Skip the "BEGIN CERTIFICATE" */
    uint8_t* pucCertBegin = strchr (signingcredentialSIGNING_CERTIFICATE_PEM, '\n');
    if (pucCertBegin == NULL)
    {
        return NULL;
    }
    pucCertBegin += 1;
    /* Skip the "END CERTIFICATE" */
    uint8_t* pucCertEnd = strrchr(pucCertBegin, '\n');
    if (pucCertEnd == NULL)
    {
        return NULL;
    }
    char *pucDecodedCertificate;
    size_t ulDecodedCertificateSize;
    mbedtls_base64_decode(pucDecodedCertificate, 0, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);
    pucDecodedCertificate = (char*) pvPortMalloc(ulDecodedCertificateSize);
    if (pucDecodedCertificate == NULL) 
    {
        return NULL;
    }    
    mbedtls_base64_decode(pucDecodedCertificate, ulDecodedCertificateSize, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);
    /* Find the tag of the ECDSA public signature*/
    uint8_t * pucPublicKeyStart = strstr(pucDecodedCertificate, pcOTA_PAL_ASN_1_ECDSA_TAG);
    if (pucPublicKeyStart == NULL) {
        vPortFree(pucDecodedCertificate);
        return NULL;
    }
    pucPublicKeyStart -= 4; 
    ulPublicKeySize = pucPublicKeyStart[1] + 2;

    vPortFree(pucDecodedCertificate);

    pucPublicKey = pvPortMalloc(ulPublicKeySize);
    if( pucPublicKey != NULL)
    {
        memcpy(pucPublicKey, pucPublicKeyStart, ulPublicKeySize);
    }
    return pucPublicKey;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ResetDevice( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ResetDevice" );
    NVIC_SystemReset();
    return kOTA_Err_ResetNotSupported;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ActivateNewImage( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ActivateNewImage" );

    /* FIX ME. */
    prvPAL_ResetDevice();
    return kOTA_Err_Uninitialized;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_SetPlatformImageState" );
    OTA_Err_t xStatus = kOTA_Err_None;
    if (xFlashEventGrp == NULL){
        /* Create the event group for flash events */
        xFlashEventGrp = xEventGroupCreate();

