aws/amazon-freertos/lib/ota/portable/nordic/nrf52840-dk/aws_ota_pal.c
        if( xFlashEventGrp == NULL )
        {
            OTA_LOG_L1( "[%s] No memory for creation of event group \n", OTA_METHOD_NAME );
            xStatus = kOTA_Err_OutOfMemory;
        }
    }
    /* Read the old image */
    /* Right now we always boot from the first bank */
    /* TODO: Support boot from the second bank */
    ImageDescriptor_t * old_descriptor = ( ImageDescriptor_t * ) ( otapalFIRST_BANK_START );
    ImageDescriptor_t new_descriptor;
    /* Check if the correct image is located at the beginning of the bank */
    if ((memcmp(old_descriptor->pMagick, pcOTA_PAL_Magick, otapalMAGICK_SIZE) != 0)&&(eState == eOTA_ImageState_Accepted)) {
        xStatus = kOTA_Err_CommitFailed;
    }
    if (xStatus == kOTA_Err_None){
        memcpy(&new_descriptor, old_descriptor, sizeof(new_descriptor));
        switch (eState) {
        case eOTA_ImageState_Accepted:
            if (old_descriptor->usImageFlags == otapalIMAGE_FLAG_COMMIT_PENDING)
            {
                new_descriptor.usImageFlags = otapalIMAGE_FLAG_VALID;
            }
            else
            {
                new_descriptor.usImageFlags = otapalIMAGE_FLAG_INVALID;
            }

            break;
        case eOTA_ImageState_Rejected:
        case eOTA_ImageState_Aborted:
            if (old_descriptor->usImageFlags == otapalIMAGE_FLAG_COMMIT_PENDING)
            {
                new_descriptor.usImageFlags = otapalIMAGE_FLAG_INVALID;
            }
            break;
        case eOTA_ImageState_Testing:
        break;
        default:
            xStatus = kOTA_Err_BadImageState;
            break;
        }

    }

    if ( xStatus == kOTA_Err_None )
    {
        /* We don't wont to do anything with flash if it would leave it in the same state as it were */
        if ((new_descriptor.usImageFlags != old_descriptor->usImageFlags)&&(eState != eOTA_ImageState_Testing))
        {
            xStatus = prvErasePages(otapalFIRST_BANK_START, otapalFIRST_BANK_START + otapalDESCRIPTOR_SIZE);
            if(xStatus == kOTA_Err_None)
            {
                xStatus = prvWriteFlash(otapalFIRST_BANK_START, sizeof(new_descriptor), (uint8_t *)&new_descriptor);
            }
        }
    }
    return xStatus;
}
/*-----------------------------------------------------------*/

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState" );

    OTA_PAL_ImageState_t xImageState = eOTA_PAL_ImageState_Invalid;

    ImageDescriptor_t * descriptor = ( ImageDescriptor_t * ) ( otapalFIRST_BANK_START );

    switch( descriptor->usImageFlags )
    {
        case otapalIMAGE_FLAG_COMMIT_PENDING:
            xImageState = eOTA_PAL_ImageState_PendingCommit;
            break;

        case otapalIMAGE_FLAG_VALID:
            xImageState = eOTA_PAL_ImageState_Valid;
            break;

        case otapalIMAGE_FLAG_INVALID:
            xImageState = eOTA_PAL_ImageState_Invalid;
            break;
    }

    return xImageState;
}
/*-----------------------------------------------------------*/

static ret_code_t prvPAL_WriteImageDescriptor( OTA_FileContext_t * const C )
{
    ImageDescriptor_t xDescriptor;
    ImageDescriptor_t xOldDescriptor;
    OTA_Err_t xStatus = kOTA_Err_None;

    memset( &xDescriptor, 0, sizeof( xDescriptor ) );

    /* Read the first bank descriptor */
    memcpy( &xOldDescriptor, ( void * ) otapalFIRST_BANK_START, sizeof( xOldDescriptor ) );

    /* Fill the new descriptor */
    if( memcmp( &xOldDescriptor.pMagick, pcOTA_PAL_Magick, otapalMAGICK_SIZE ) == 0 ) /* Check if an AFR image contained in the first bank */
    {
        xDescriptor.ulSequenceNumber = xOldDescriptor.ulSequenceNumber + 1;
    }
    else /* It seems that the first bank contains a classic Nordic image */
    {
        xDescriptor.ulSequenceNumber = 1;
    }

    memcpy( &xDescriptor.pMagick, pcOTA_PAL_Magick, otapalMAGICK_SIZE );
    xDescriptor.ulStartAddress = otapalSECOND_BANK_START + otapalDESCRIPTOR_SIZE;
    xDescriptor.ulEndAddress = xDescriptor.ulStartAddress + C->ulFileSize;
    xDescriptor.ulExecutionAddress = xDescriptor.ulStartAddress; /* TODO: Check if this assumption is true */
    xDescriptor.ulHardwareID = 0;                                /* TODO: Fill the Hardware ID */
    xDescriptor.usImageFlags = otapalIMAGE_FLAG_NEW;
    xDescriptor.ulSignatureSize = C->pxSignature->usSize;

    if( C->pxSignature != NULL)
    {
      if( C->pxSignature->usSize <= kOTA_MaxSignatureSize)
       {
          memcpy( &xDescriptor.pSignature, C->pxSignature->ucData, C->pxSignature->usSize );
       }
     }

    return prvWriteFlash( otapalSECOND_BANK_START, sizeof( xDescriptor ), (uint8_t *)&xDescriptor );
}

/*-----------------------------------------------------------*/

/* Write a block of data to the specified file. */
ret_code_t prvWriteFlash( uint32_t ulOffset,
                          uint32_t ulBlockSize,
                          uint8_t * const pacData )
{
    uint32_t ulByteIndex, ul32BitBlocksTosend, ulTotal32BitBlocks, ul32BitBlocksSent;
    ret_code_t xErrCode = NRF_SUCCESS;
    ulTotal32BitBlocks = (ulBlockSize+3)/4;
    ul32BitBlocksSent = 0;
    ulByteIndex = 0;

    while(ul32BitBlocksSent < ulTotal32BitBlocks)
    {
      ul32BitBlocksTosend = 0;

      while((ul32BitBlocksSent + ul32BitBlocksTosend < ulTotal32BitBlocks)
            &&(ul32BitBlocksTosend < otapalSERIALIZING_ARRAY_SIZE)
            &&(ul32BitBlocksTosend < NRF_FICR->CODEPAGESIZE))
      {
            if(ulByteIndex < ulBlockSize)
            {
                pulSerializingArray[ul32BitBlocksTosend++] = pacData[ulByteIndex++]<<24; /*Increment ul32BitBlocksTosend here, as it is being used. */
            }

            if(ulByteIndex < ulBlockSize)
            {
                pulSerializingArray[ul32BitBlocksTosend] |= pacData[ulByteIndex++]<<16;
            }

            if(ulByteIndex < ulBlockSize)
            {
                pulSerializingArray[ul32BitBlocksTosend] |= pacData[ulByteIndex++]<<8;
            }

            if(ulByteIndex < ulBlockSize)
            {
                pulSerializingArray[ul32BitBlocksTosend] |= pacData[ulByteIndex++];
            }

            ul32BitBlocksTosend++;            
      }

      xEventGroupClearBits( xFlashEventGrp, otapalFLASH_SUCCESS | otapalFLASH_FAILURE );
      /* Softdevice can write only by 32-bit words */
      ret_code_t xErrCode = sd_flash_write( ( uint32_t * ) ulOffset, pulSerializingArray, ul32BitBlocksTosend );

