aws/amazon-freertos/lib/ota/portable/nordic/nrf52840-dk/aws_ota_pal.c
      if( xErrCode == NRF_SUCCESS )
      {
          EventBits_t xFlashResult = xEventGroupWaitBits( xFlashEventGrp, otapalFLASH_SUCCESS | otapalFLASH_FAILURE, pdTRUE, pdFALSE, portMAX_DELAY );

          if( xFlashResult & otapalFLASH_FAILURE )
          {
              xErrCode = NRF_ERROR_INTERNAL;
              break;
          }
      }
      ul32BitBlocksSent += ul32BitBlocksTosend;

    }

    return xErrCode;
}
/*-----------------------------------------------------------*/

ret_code_t prvComputeSHA256Hash( void * pvMessage,
                                 size_t ulMessageSize,
                                 void * pvHashDigest,
                                 size_t * pulDigestSize )
{
    /* We are computing the hash of memory stored on the flash so we need to first move it to ram to use CC310
     * That's why we are computing the hash by chunks */
    ret_code_t err_code;
    static nrf_crypto_hash_context_t hash_context;

    err_code = nrf_crypto_hash_init( &hash_context, &g_nrf_crypto_hash_sha256_info );
    uint8_t pulMemBuffer[ 256 ];
    size_t ulConsumed = 0;

    while( err_code == NRF_SUCCESS && ulConsumed < ulMessageSize )
    {
        size_t ulToConsume = MIN( ulMessageSize - ulConsumed, 256 );
        memcpy( pulMemBuffer, pvMessage + ulConsumed, ulToConsume );
        err_code = nrf_crypto_hash_update( &hash_context, pulMemBuffer, ulToConsume );
        ulConsumed += ulToConsume;
    }

    if( err_code == NRF_SUCCESS )
    {
        err_code = nrf_crypto_hash_finalize( &hash_context, pvHashDigest, pulDigestSize );
    }

    return err_code;
}

/*-----------------------------------------------------------*/

ret_code_t prvVerifySignature( uint8_t * pusHash,
                               size_t ulHashSize,
                               uint8_t * pusSignature,
                               size_t ulSignatureSize,
                               uint8_t * pucPublicKey,
                               uint32_t ulPublicKeySize)
{
    ret_code_t xErrCode;
    nrf_crypto_ecdsa_verify_context_t xVerifyContext;
    nrf_crypto_ecc_public_key_t xPublicKey;
    nrf_crypto_ecdsa_signature_t xSignature;
    uint8_t * pucTmpPublicKey;

    memset( &xPublicKey, 0, sizeof( xPublicKey ) );
    memset( &xSignature, 0, sizeof( xSignature ) );
    
    /* The public key comes in the ASN.1 DER format,  and so we need everything
     * except the DER metadata which fortunately in this case is containded in the front part of buffer */
    pucTmpPublicKey  = pucPublicKey + ( ulPublicKeySize - NRF_CRYPTO_ECC_SECP256R1_RAW_PUBLIC_KEY_SIZE );
    /* Convert the extracted public key to the NRF5 representation */
    xErrCode = nrf_crypto_ecc_public_key_from_raw( &g_nrf_crypto_ecc_secp256r1_curve_info, &xPublicKey, pucTmpPublicKey, NRF_CRYPTO_ECC_SECP256R1_RAW_PUBLIC_KEY_SIZE );
    if (xErrCode == NRF_SUCCESS) {
        /* The signature is also ASN.1 DER encoded, but here we need to decode it properly */
        xErrCode = asn1_decodeSignature( xSignature, pusSignature, pusSignature + ulSignatureSize );
    }
    if (xErrCode == 0) {
        /* Aand... Verify! */
        xErrCode = nrf_crypto_ecdsa_verify( &xVerifyContext,                             /* Context */
                                            &xPublicKey,                                 /* Public key */
                                            pusHash,                                     /* Message hash */
                                            ulHashSize,                                  /* Hash size */
                                            xSignature,                                  /* Signature */
                                            NRF_CRYPTO_ECDSA_SECP256R1_SIGNATURE_SIZE ); /* Signature size */

    }
    return xErrCode;
}

/*-----------------------------------------------------------*/

void flash_event_handler( uint32_t evt_id,
                          void * p_context )
{
    switch( evt_id )
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:

            if( xFlashEventGrp != NULL )
            {
                xEventGroupSetBits( xFlashEventGrp, otapalFLASH_SUCCESS );
            }

            break;

        case NRF_EVT_FLASH_OPERATION_ERROR:

            if( xFlashEventGrp != NULL )
            {
                xEventGroupSetBits( xFlashEventGrp, otapalFLASH_FAILURE );
            }

            break;
    }
}

NRF_SDH_SOC_OBSERVER( flash_observer, BLE_DFU_SOC_OBSERVER_PRIO, flash_event_handler, NULL );

OTA_Err_t testCheckSignature(){
    OTA_FileContext_t C;
    uint32_t ulCertSize = sizeof(signingcredentialSIGNING_CERTIFICATE_PEM);
    uint8_t * pusCertificate = prvPAL_ReadAndAssumeCertificate(signingcredentialSIGNING_CERTIFICATE_PEM, &ulCertSize);
    vPortFree( pusCertificate ); 
    ImageDescriptor_t * descriptor = ( ImageDescriptor_t * ) ( otapalSECOND_BANK_START );
    C.ulFileSize = descriptor->ulEndAddress - descriptor->ulStartAddress;
    return prvPAL_CheckFileSignature( &C );
}


/* Provide access to private members for testing. */
#ifdef AMAZON_FREERTOS_ENABLE_UNIT_TESTS
    #include "aws_ota_pal_test_access_define.h"
#endif
